{
  "googleScholarProfileId": "rC6hYXwAAAAJ",
  "publications": [
    {
      "title": "WHISPERS OF THE NETWORKS: MASTERING IOT COMMUNICATIONS",
      "authors": "Muhammed Fuhad; Athul Nambiar",
      "venue": "Book Publication",
      "publisher": "Independently published",
      "year": "2025",
      "type": "Book",
      "doi": null,
      "pages": null,
      "isbn": "979-8276389226",
      "link": "https://www.amazon.com/WHISPERS-NETWORKS-MASTERING-IOT-COMMUNICATIONS/dp/B0G53GM4Z4",
      "abstract": "The Internet of Things is no longer a futuristic concept; it’s the backbone of modern technology. From smart cities and intelligent agriculture to cloud-driven automation, IoT is transforming how devices think, communicate, and evolve. Whispers of the Networks: Mastering IoT Communications is your complete, practical, and beginner-friendly guide to understanding how billions of devices talk to each other, quietly shaping the world around us.\n\nBuilt on clear explanations, real-world examples, diagrams, and step-by-step learning, this book takes you from the foundations of IoT to advanced communication architectures used in industry today. Whether you're a student, developer, researcher, or enthusiast, this book gives you everything you need to understand and build IoT communication systems confidently.",
      "keywords": ["IoT", "Network Communication", "Smart Cities", "Cloud Automation", "Beginner Friendly", "IoT Architecture"],
      "status": "Published",
      "impact": "High",
      "citations": 0,
      "lastUpdated": "2026-01-07T00:00:00.000Z",
      "icon": "BookOpen",
      "color": "#ec4899",
      "googleScholarId": null
    },
    {
      "title": "Cost Effective and Energy Efficient Drip Irrigation System for IoT Enabled Smart Agriculture",
      "authors": "Muhammed Fuhad C, Stenin George, Manu Elappila, Sachin Malayath Jose",
      "venue": "Proceedings of the International Conference on Smart Technologies for Smart Nation (SmartTechCon 2024)",
      "publisher": "Springer Nature Singapore",
      "year": "2024",
      "type": "Conference Paper",
      "doi": "10.1007/978-981-97-1841-2_14",
      "pages": "189-201",
      "isbn": "978-981-97-1841-2",
      "abstract": "The conventional methods of smart farming consume a significant percentage of the resources such as water, electricity, and manpower. This approach demands more time, money, and effort. The state of the art drip irrigation methods make use of the solenoid valve to control the water flow. The problem with such a system is reflected in its power consumption which is a significant factor for large-scale demands. The method proposed in this paper addresses this problem by developing an automated drip irrigation system that replaces components used in conventional methods with its economical counterparts in the market. A system using Node MCU, DC submersible motor, and soil moisture sensor is developed to automate the irrigation process ensuring efficient water and energy consumption. Since the proposed system utilizes economically cheaper components, it provides an upper edge over other systems in terms of expenditure and in turn economically feasible for large-scale demands. A mobile application is also developed to control, monitor, and schedule irrigation processes.",
      "keywords": ["IoT", "Smart Agriculture", "Drip Irrigation", "Energy Efficiency", "Cost Optimization", "Solenoid Valves"],
      "status": "Published",
      "impact": "High",
      "citations": 2,
      "lastUpdated": "2024-11-10T00:00:00.000Z",
      "icon": "BookOpen",
      "color": "#10b981",
      "googleScholarId": "cost-effective-energy-efficient-drip-irrigation-2024"
    },
    {
      "title": "Automated Contactless Continuous Temperature Monitoring System for Pandemic Disease Controlling Infrastructures",
      "authors": "Muhammed Fuhad C, Stenin George, Manu Elappila, Sachin Malayath Jose",
      "venue": "2023 International Conference on Recent Trends in Electronics and Communication (ICRTEC)",
      "publisher": "IEEE",
      "year": "2023",
      "type": "Conference Paper",
      "doi": "10.1109/ICRTEC56977.2023.10111891",
      "pages": "1-6",
      "isbn": "978-1-6654-1234-5",
      "abstract": "People are being thermally screened in hospitals and in such facilities, all the data collected must be stored and displayed. The person responsible for keeping track of people's body temperatures must put in more time and effort. This approach is a tedious task, especially during times of dealing with the pandemic diseases like Covid-19. Hence, in this paper, an automated contactless continuous temperature monitoring system is designed to eliminate this time-consuming process. If a person's temperature is too high, that is, higher than the usual temperature range, the system records it and monitors it continuously via a mobile application. In this paper, we present the development of an Automated contactless continuous body temperature monitoring system using a Raspberry Pi camera and mobile application.",
      "keywords": ["IoT", "Temperature Monitoring", "Pandemic Control", "Contactless", "Real-time Alerts", "Data Analytics"],
      "status": "Published",
      "impact": "High",
      "citations": 1,
      "lastUpdated": "2024-11-10T00:00:00.000Z",
      "icon": "BookOpen",
      "color": "#3b82f6",
      "googleScholarId": "automated-contactless-temperature-monitoring-2023"
    },
    {
      "title": "A Study on Potential Integration of Generative AI and IoT with a Real-world Example of Voice Assistance Application",
      "authors": "Muhammed Fuhad C",
      "venue": "Under Review",
      "publisher": "TBD",
      "year": "2024",
      "type": "Research Paper",
      "doi": null,
      "pages": null,
      "isbn": null,
      "abstract": "This study explores the potential integration of Generative AI and IoT technologies, demonstrating practical applications through a voice assistance system that combines AI capabilities with IoT infrastructure.",
      "keywords": ["Generative AI", "IoT", "Voice Assistance", "AI Integration", "Smart Systems"],
      "status": "Submitted",
      "impact": "High",
      "citations": 0,
      "lastUpdated": "2024-01-01T00:00:00.000Z",
      "icon": "BookOpen",
      "color": "#8b5cf6",
      "googleScholarId": null
    },
    {
      "title": "Developing IoT Visualization and Control System for Fog Computing Infrastructure",
      "authors": "Muhammed Fuhad C",
      "venue": "ARAIMESF 2024 - Annual Research and Innovation Meet in Engineering and Science Festival",
      "publisher": "National Institute of Technology, Rourkela",
      "year": "2024",
      "type": "Abstract",
      "doi": null,
      "pages": null,
      "isbn": null,
      "abstract": "Abstract presented at ARAIMESF 2024, National Institute of Technology, Rourkela, focusing on IoT visualization and control systems for fog computing infrastructure.",
      "keywords": ["IoT", "Fog Computing", "Visualization", "Control Systems", "Infrastructure"],
      "status": "Presented",
      "impact": "Medium",
      "citations": 0,
      "lastUpdated": "2024-01-01T00:00:00.000Z",
      "icon": "BookOpen",
      "color": "#f59e0b",
      "googleScholarId": null
    }
  ],
  "researchFocusAreas": [
    {
      "title": "Smart Agriculture",
      "description": "IoT-based irrigation systems and crop monitoring solutions",
      "icon": "BookOpen",
      "color": "#16a34a"
    },
    {
      "title": "Healthcare Monitoring",
      "description": "Contactless monitoring systems for health and safety",
      "icon": "Award",
      "color": "#3b82f6"
    },
    {
      "title": "IoT Systems",
      "description": "Energy-efficient and cost-effective IoT solutions",
      "icon": "FileText",
      "color": "#8b5cf6"
    }
  ]
}
